Ran Plan for dir: `staging-backend-236514/gcs` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_backend_bucket.static_files will be destroyed
  # (because google_compute_backend_bucket.static_files is not in configuration)
- resource "google_compute_backend_bucket" "static_files" {
      - bucket_name        = "gg-static-files" -> null
      - creation_timestamp = "2021-06-07T07:03:55.464-07:00" -> null
      - description        = "Contains getground static files" -> null
      - enable_cdn         = true -> null
      - id                 = "projects/staging-backend-236514/global/backendBuckets/gg-static-files-backend" -> null
      - name               = "gg-static-files-backend" -> null
      - project            = "staging-backend-236514" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/staging-backend-236514/global/backendBuckets/gg-static-files-backend" -> null

      - cdn_policy {
          - signed_url_cache_max_age_sec = 0 -> null
        }
    }

  # google_compute_global_address.static_files will be destroyed
  # (because google_compute_global_address.static_files is not in configuration)
- resource "google_compute_global_address" "static_files" {
      - address            = "35.244.161.30" -> null
      - address_type       = "EXTERNAL" -> null
      - creation_timestamp = "2021-06-07T07:03:53.540-07:00" -> null
      - id                 = "projects/staging-backend-236514/global/addresses/static-lb-ip" -> null
      - name               = "static-lb-ip" -> null
      - prefix_length      = 0 -> null
      - project            = "staging-backend-236514" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/staging-backend-236514/global/addresses/static-lb-ip" -> null
    }

  # google_compute_global_forwarding_rule.static_files will be destroyed
  # (because google_compute_global_forwarding_rule.static_files is not in configuration)
- resource "google_compute_global_forwarding_rule" "static_files" {
      - id                    = "projects/staging-backend-236514/global/forwardingRules/gg-static-files-forwarding-rule" -> null
      - ip_address            = "35.244.161.30" -> null
      - ip_protocol           = "TCP" -> null
      - load_balancing_scheme = "EXTERNAL" -> null
      - name                  = "gg-static-files-forwarding-rule" -> null
      - port_range            = "443-443" -> null
      - project               = "staging-backend-236514" -> null
      - self_link             = "https://www.googleapis.com/compute/v1/projects/staging-backend-236514/global/forwardingRules/gg-static-files-forwarding-rule" -> null
      - target                = "https://www.googleapis.com/compute/v1/projects/staging-backend-236514/global/targetHttpsProxies/gg-static-files-target-proxy" -> null
    }

  # google_compute_managed_ssl_certificate.static_files will be destroyed
  # (because google_compute_managed_ssl_certificate.static_files is not in configuration)
- resource "google_compute_managed_ssl_certificate" "static_files" {
      - certificate_id            = 7566027817890315455 -> null
      - creation_timestamp        = "2021-06-07T18:05:20.867-07:00" -> null
      - expire_time               = "2022-10-14T11:11:39.000-07:00" -> null
      - id                        = "projects/staging-backend-236514/global/sslCertificates/7566027817890315455" -> null
      - name                      = "gg-static-files-ssl-cert" -> null
      - project                   = "staging-backend-236514" -> null
      - self_link                 = "https://www.googleapis.com/compute/v1/projects/staging-backend-236514/global/sslCertificates/gg-static-files-ssl-cert" -> null
      - subject_alternative_names = [
          - "static1.getground.co.uk",
        ] -> null
      - type                      = "MANAGED" -> null

      - managed {
          - domains = [
              - "static1.getground.co.uk",
            ] -> null
        }

      - timeouts {}
    }

  # google_compute_target_https_proxy.static_files will be destroyed
  # (because google_compute_target_https_proxy.static_files is not in configuration)
- resource "google_compute_target_https_proxy" "static_files" {
      - creation_timestamp = "2021-06-07T07:04:19.138-07:00" -> null
      - id                 = "projects/staging-backend-236514/global/targetHttpsProxies/gg-static-files-target-proxy" -> null
      - name               = "gg-static-files-target-proxy" -> null
      - project            = "staging-backend-236514" -> null
      - proxy_id           = 2606658235437128076 -> null
      - quic_override      = "NONE" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/staging-backend-236514/global/targetHttpsProxies/gg-static-files-target-proxy" -> null
      - ssl_certificates   = [
          - "https://www.googleapis.com/compute/v1/projects/staging-backend-236514/global/sslCertificates/gg-static-files-ssl-cert",
        ] -> null
      - url_map            = "https://www.googleapis.com/compute/v1/projects/staging-backend-236514/global/urlMaps/gg-static-files-map" -> null
    }

  # google_compute_url_map.static_files will be destroyed
  # (because google_compute_url_map.static_files is not in configuration)
- resource "google_compute_url_map" "static_files" {
      - creation_timestamp = "2021-06-07T07:04:07.400-07:00" -> null
      - default_service    = "https://www.googleapis.com/compute/v1/projects/staging-backend-236514/global/backendBuckets/gg-static-files-backend" -> null
      - fingerprint        = "V5lbbFXJQEk=" -> null
      - id                 = "projects/staging-backend-236514/global/urlMaps/gg-static-files-map" -> null
      - map_id             = 5113786282842233272 -> null
      - name               = "gg-static-files-map" -> null
      - project            = "staging-backend-236514" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/staging-backend-236514/global/urlMaps/gg-static-files-map" -> null
    }

  # google_storage_bucket.static_files must be replaced
-/+ resource "google_storage_bucket" "static_files" {
      ~ bucket_policy_only          = false -> (known after apply)
      - default_event_based_hold    = false -> null
      ~ id                          = "gg-static-files" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "gg-static-files" -> "gg-atlantis-spike" # forces replacement
      ~ project                     = "staging-backend-236514" -> (known after apply)
      - requester_pays              = false -> null
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/gg-static-files" -> (known after apply)
      ~ uniform_bucket_level_access = false -> (known after apply)
      ~ url                         = "gs://gg-static-files" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # google_storage_default_object_access_control.static_files_public_read will be updated in-place
~ resource "google_storage_default_object_access_control" "static_files_public_read" {
      ~ bucket       = "gg-static-files" -> "gg-atlantis-spike"
        id           = "gg-static-files/allUsers"
        # (4 unchanged attributes hidden)
    }

  # null_resource.example will be created
+ resource "null_resource" "example" {
      + id = (known after apply)
    }

Plan: 2 to add, 1 to change, 7 to destroy.

Changes to Outputs:
- static_files_ip = "35.244.161.30" -> null

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d staging-backend-236514/gcs`
* :put_litter_in_its_place: To **delete** this plan click [here](https://69fa-85-245-40-132.eu.ngrok.io/lock?id=pmspeixoto%252Fatlantis-spike%252Fstaging-backend-236514%252Fgcs%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d staging-backend-236514/gcs`
</details>
Plan: 2 to add, 1 to change, 7 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
